<template><div><h1 id="_4-过期删除与内存淘汰" tabindex="-1"><a class="header-anchor" href="#_4-过期删除与内存淘汰"><span>4. 过期删除与内存淘汰</span></a></h1>
<p>过期删除是删除过期的键值对。
内存淘汰是内存已满时，淘汰一些键值对，腾出内存空间。</p>
<h2 id="过期删除" tabindex="-1"><a class="header-anchor" href="#过期删除"><span>过期删除</span></a></h2>
<p>Redis 过期删除包括主动删除和被动删除两种。</p>
<p>主动删除是指，使用异步线程扫描键值对，将过期的键值对删除。</p>
<p>被动删除是指，客户端访问键值对时，首先判断是否过期，再进行删除。</p>
<h2 id="淘汰策略" tabindex="-1"><a class="header-anchor" href="#淘汰策略"><span>淘汰策略</span></a></h2>
<p>Redis 淘汰策略大致分为两类：不进行淘汰和进行淘汰。</p>
<p>不进行淘汰策略中，当内存已满，新键值对插入操作无法进行，但查询删除修改仍能正常执行。</p>
<p>进行淘汰策略中，又可以分为针对有过期时间数据和所有数据。
针对有过期时间的数据，可以使用随机、ttl、lru 和 lfu。
针对所有数据，可以使用随机、lru 和 lfu。</p>
</div></template>


