<template><div><h1 id="_1-网络模型" tabindex="-1"><a class="header-anchor" href="#_1-网络模型"><span>1. 网络模型</span></a></h1>
<h2 id="介绍一下-osi-七层网络模型和-tcp-ip-网络模型" tabindex="-1"><a class="header-anchor" href="#介绍一下-osi-七层网络模型和-tcp-ip-网络模型"><span>介绍一下 OSI 七层网络模型和 TCP/IP 网络模型</span></a></h2>
<p>OSI 七层网络模型是国际标准化组织提出的网络模型，共有七层。
自上而下分别是：应用层、表示层、会话层、传输层、网络层、数据链路层和物理层。
但该种模型比较复杂，在实际使用中，更多地采用 TCP/IP 网络模型。</p>
<p>TCP/IP 网络模型自上而下分为四层，分别是应用层、传输层、网络层和网络接口层。</p>
<p>应用层的主要功能是为用户提供应用功能，常见的应用层协议包括 HTTP、TELNET、SSH 等。</p>
<p>传输层的主要功能是为提供应用进程之间的数据传输服务。常见的传输层协议包括 TCP 和 UDP。
TCP 面向连接，提供可靠的数据传输服务；UDP 无连接，提供不可靠的数据传输服务，但效率高。</p>
<p>网络层的主要功能是提供网络间的数据传输服务。常见的网络层协议包括 IP、ICMP 等。</p>
<p>网络接口层的主要功能是提供物理网络上的数据传输与网络接口管理。常见的网络接口层协议包括以太网、ARP 等。</p>
</div></template>


